import LessonTemp from "@/app/classroom/_comp/LessonTemp";

// Mock data for the course
const lessonData = {
  id: "1",
  title: "مفهوم تطبيقات الهواتف الذكية",
  videoUrl: 'https://www.youtube.com/embed/f59YHZN6Lxo?si=TYNjJbedoLNY6idP',
  content: `
    تُعرف تطبيقات الهواتف الذكية بأنها برمجيات مصممة خصيصًا للعمل على الأجهزة النقالة، يتم تحميلها من المتاجر الإلكترونية أو تكون محمّلة مسبقًا على الأجهزة، وتهدف إلى تقديم خدمات متنوعة للمستخدمين، سواء كانت تعليمية أو ترفيهية أو خدمية، عبر واجهات تصميمية تفاعلية تسهل الاستخدام في أي وقت ومكان، وقد تكون هذه التطبيقات مجانية أو مقابل رسوم مالية.
  `,
  question: {
    text: 'يمكن تحميل تطبيقات الهواتف الذكية من خلال ....',
    options: [
      'المتاجر الإلكترونية',
      'السحابة الإلكترونية',
      'البريد الإلكتروني',
      'المدونات الإلكترونية'
    ],
    feedback: [
      'بالفعل يمكن تحميل تطبيق الهاتف الذكي من خلال المتجر الإلكتروني مثل google play و متجر app store',
      'السحابة الإلكترونية هي خدمة يمكن الاستفادة منها في تخزين واسترجاع البيانات والملفات وليس الهدف منها تحميل التطبيقات',
      'البريد الإلكتروني هو وسيلة للتواصل بين الأشخاص وليس لتحميل التطبيقات',
      'المدونات الإلكترونية تعتبر أحد أنواع صفحات الويب التي يمكن من خلالها نشر ومشاركة العديد من الموضوعات بين الأشخاص'
    ]
  },
  correctIndex: 0,
};

export default function Lesson() {
  return (
    <>

      <div className="flex flex-1 flex-col gap-4 p-4 pt-0">
        <div>
          <LessonTemp lessonData={lessonData} />
        </div>
      </div>
    </>
  );
}
